<a href="https://colab.research.google.com/github/calebmckay1/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/module3-join-and-reshape-data/LS_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [1]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-05-07 01:56:48--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.147.166
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.147.166|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  41.7MB/s    in 4.5s

2020-05-07 01:56:52 (43.2 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [2]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [3]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [4]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
import pandas as pd

order_train = pd.read_csv('order_products__train.csv')
order_prior = pd.read_csv('order_products__prior.csv')
products = pd.read_csv('products.csv')

# loaded the datasets into dataframes

# going to need order_train, order_prior, and products dataframes.

# going to need "product_name", and "product_id" from products dataframe and 
# "product_id" column from order_train and order_prior dataframe

In [6]:
products_clean = products.drop(['aisle_id', 'department_id'], axis=1)
products_clean.head()

# dropped the unneeded columns, and used .head() to double check

   product_id                                       product_name
0           1                         Chocolate Sandwich Cookies
1           2                                   All-Seasons Salt
2           3               Robust Golden Unsweetened Oolong Tea
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4           5                          Green Chile Anytime Sauce

In [7]:
order_train_clean = order_train.drop(['reordered', 'order_id', 'add_to_cart_order'], axis=1)
order_prior_clean = order_prior.drop(['reordered', 'order_id','add_to_cart_order'], axis=1)
order_train_clean.head()

# dropped the unneeded columns and double checked with .head()

   product_id
0       49302
1       11109
2       10246
3       49683
4       43633

In [8]:
products_clean['product_name'].value_counts().nlargest(10)

# couldn't just simply view the amount of orders through the products
# dataframe. Looks like this df is just a placeholder for the product
# name and the corresponding product id numbers.

# We're gonna have to merge. Get ready.

Jewelry Cleaner                           1
Strawberry Protein Shake                  1
Medium Tex Mex Salsa                      1
Ancient Grain Granola Cranberry Pecan     1
Fragrance Free Baby Shampoo & Wash        1
Honey Maid Star Wars                      1
Natural Sliced Baby Swiss Cheese          1
Madras Curry Spicy Indian Simmer Sauce    1
Itchy Dry Scalp Shampoo                   1
White Enriched Bread                      1
Name: product_name, dtype: int64

In [0]:
order_prior_merged = pd.merge(order_prior_clean, products_clean, on='product_id', how='inner')

# merged the cleaned dateframe of order_prior (order_prior_clean) with the cleaned 
# dataframe products(products_clean) in order to match the product_id and 
# product_name to the amount of orders placed. Let's check the values.

In [10]:
order_prior_merged['product_name'].value_counts().nlargest(10)

# looks about right. But we're forgetting a dataframe.. The train data.

Banana                    472565
Bag of Organic Bananas    379450
Organic Strawberries      264683
Organic Baby Spinach      241921
Organic Hass Avocado      213584
Organic Avocado           176815
Large Lemon               152657
Strawberries              142951
Limes                     140627
Organic Whole Milk        137905
Name: product_name, dtype: int64

In [0]:
order_train_merged = pd.merge(order_train_clean, products_clean, on='product_id', how='inner')

# merged the train data with the products data. Lets run the numbers now.

In [12]:
order_train_merged['product_name'].value_counts().nlargest(10)

# looks good. Now, we could simply add these values up to the other merged 
# dataframe using a calculator, but that's a long process let's just see if we 
# can merge the 2 newly merged dataframes into one.

Banana                    18726
Bag of Organic Bananas    15480
Organic Strawberries      10894
Organic Baby Spinach       9784
Large Lemon                8135
Organic Avocado            7409
Organic Hass Avocado       7293
Strawberries               6494
Limes                      6033
Organic Raspberries        5546
Name: product_name, dtype: int64

In [0]:
### order_all_merged = pd.merge(order_train_merged, order_prior_merged, on='product_id', how='inner')

# The syntax seems like it could've worked but I couldn't run the cell. It 
# kept crashing colab. Had to put this computer into high RAM mode and 
# it still couldn't handle the heat. That's odd.

In [0]:
order_all_merged = pd.concat([order_train_merged, order_prior_merged])

In [15]:
order_all_merged['product_name'].value_counts().nlargest(10)

# well.. looks like i was doing the wrong thing the whole time, didn't have 
# to merge the 2 final dataframes. Had to concat them.

# To answer the question in the first part of this assignment, these are the 
# most purchased products and the values below are the amount of times each 
# product was purchased.

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [53]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

# okay so the transpose looks like swaps the row and columns around

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [17]:
table1

# looks like resetting index adds the numbers on the side, pretty neat.

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [18]:
table1 = table1.reset_index()
table1

          index  treatmenta  treatmentb
0    John Smith         NaN           2
1      Jane Doe        16.0          11
2  Mary Johnson         3.0           1

In [19]:
tidy1 = table1.melt(id_vars='index', value_vars=['treatmenta', 'treatmentb'])

tidy1

# this is makes sense looking at the table below, but the code like the 
# id_vars= and value_vars= kinda confusing, gonna have to look more into them.

          index    variable  value
0    John Smith  treatmenta    NaN
1      Jane Doe  treatmenta   16.0
2  Mary Johnson  treatmenta    3.0
3    John Smith  treatmentb    2.0
4      Jane Doe  treatmentb   11.0
5  Mary Johnson  treatmentb    1.0

In [20]:
tidy1 = tidy1.rename(columns={
    'index':'name',
    'variable':'trt',
    'value':'result'
})

tidy1

# now this one makes sense. Very straightforward, swapping 
# previous column names with ones you want to give it,
# while creating a new table "tidy1" at the same time.

           name         trt  result
0    John Smith  treatmenta     NaN
1      Jane Doe  treatmenta    16.0
2  Mary Johnson  treatmenta     3.0
3    John Smith  treatmentb     2.0
4      Jane Doe  treatmentb    11.0
5  Mary Johnson  treatmentb     1.0

In [21]:
tidy1.trt = tidy1.trt.str.replace('treatment', '')
tidy1

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

In [22]:
wide = tidy1.pivot_table(index='name', columns='trt', values='result')
wide

# feel like I'm getting much better in understanding the structure of the code,
# only had to click back to the lecture notes once, really understanding where 
# commas and quotations, and brackets and parethesis go. Little helper thing
# helps too. I was beginning to type "pivot.table" and it popped up "pivot_table" 
# to help me out, pretty neat.

trt              a     b
name
Jane Doe      16.0  11.0
John Smith     NaN   2.0
Mary Johnson   3.0   1.0

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
table2 = table1.T
table2 = table2.reset_index()
table2

In [108]:
tidy2 = table2.melt(id_vars=['index'])
tidy2

# was working on this for like 2 hours, and finally just got lucky
# trying out so many different things in order to get all 3 columns to show up.
# previous errors said 'treatmenta and b wasn't in index so I couldn't use
# that route and instructions said I'm not allowed to use transpose.

# probably going to need additional help on this .melt() portion.

# was trying to get the names in the identifier column but this is all i could
# do for right now..

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [113]:
tidy2 = tidy2.rename(columns={
    'index': 'trt', 
    'variable': 'name', 
    'value': 'result'
})
tidy2 

# changed the names of the column headers, this portion made sense.

          trt          name  result
0  treatmenta    John Smith     NaN
1  treatmentb    John Smith     2.0
2  treatmenta      Jane Doe    16.0
3  treatmentb      Jane Doe    11.0
4  treatmenta  Mary Johnson     3.0
5  treatmentb  Mary Johnson     1.0

In [115]:
columns_titles = ['name',"trt", 'result']
tidy2=tidy2.reindex(columns=columns_titles)
tidy2

# not sure if that did the trick and actually put the name in the actual
# id_vars spot or if it just swapped the variable and identifiers meaning
# trt is still the identifier, and name the variable.

           name         trt  result
0    John Smith  treatmenta     NaN
1    John Smith  treatmentb     2.0
2      Jane Doe  treatmenta    16.0
3      Jane Doe  treatmentb    11.0
4  Mary Johnson  treatmenta     3.0
5  Mary Johnson  treatmentb     1.0

In [117]:
tidy2.trt = tidy2.trt.str.replace('treatment', '')

tidy2

# took out the "treatment" for better clarity

           name trt  result
0    John Smith   a     NaN
1    John Smith   b     2.0
2      Jane Doe   a    16.0
3      Jane Doe   b    11.0
4  Mary Johnson   a     3.0
5  Mary Johnson   b     1.0

In [0]:
tidy3 = tidy2.copy()

# made a copy of tidy2 to try to turn it back into table2 within messing with 
# current results lol

In [119]:
tidy3

           name trt  result
0    John Smith   a     NaN
1    John Smith   b     2.0
2      Jane Doe   a    16.0
3      Jane Doe   b    11.0
4  Mary Johnson   a     3.0
5  Mary Johnson   b     1.0

In [124]:
wide = tidy3.pivot_table(index='trt', columns='name', values='result')

wide

# not really sure how I did it but both tables look pretty similar. Had
# to end up switching index to 'trt', and columns to 'name'. This was way easier
# than melting for sure.

name  Jane Doe  John Smith  Mary Johnson
trt
a         16.0         NaN           3.0
b         11.0         2.0           1.0

In [125]:
table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
import seaborn as sns
flights = sns.load_dataset('flights')
flights

In [126]:
# Flights Pivot Table
flights.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [128]:
wide_flight = flights.pivot_table(index='year', columns='month', values='passengers')
wide_flight

# pivot_tables I understand, didnt even have to think about this one. But the 
# inverse of pivot_table, .melt(), i probably need some extra help on. Was pretty
# tired today so lack of sleep probably got the best of me also.

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####